const gradient = require('gradient-string')

function mostrarBanner() {
  console.clear()
  
  console.log(gradient.rainbow.multiline(`
████████╗ ██████╗ ███████╗██╗  ██╗██╗██████╗ ██╗   ██╗███████╗
╚══██╔══╝██╔═══██╗██╔════╝██║  ██║██║██╔══██╗██║   ██║╚══███╔╝
   ██║   ██║   ██║███████╗███████║██║██████╔╝██║   ██║  ███╔╝ 
   ██║   ██║   ██║╚════██║██╔══██║██║██╔══██╗██║   ██║ ███╔╝  
   ██║   ╚██████╔╝███████║██║  ██║██║██║  ██║╚██████╔╝███████╗
   ╚═╝    ╚═════╝ ╚══════╝╚═╝  ╚═╝╚═╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝
`))
  
  console.log('\x1b[2mOwner: Matheus Henrique - 558391762245\x1b[0m\n')
}

module.exports = mostrarBanner